app/Http/Controllers/Order/OrderController.php

    public function orderList(Request $request)
    {

        $order = Order::with(['user:id,name', 'shipping_area:id,city'])
            ->orderBy('id', 'desc');

        if ($request->status != '') {
            $order->where('status', '=', $request->status);
        }

        if ($request->order_id != '') {
            $order->where('id', 'LIKE', '%' . $request->order_id . '%');
        }

        if ($request->city != 'undefined') {
            $order->where('shipping_area_id', '=', $request->city);
        }

        if ($request->payment != '') {
            $order->where('payment_status', '=', $request->payment);
        }

        if ($request->user_id != '') {
            $order->where('user_id', '=', $request->user_id);
        }
        // $order = $order->toSql();
        $order = $order->paginate(10);
---
select * from `shipping_areas` where 0 = 1
select count(*) as aggregate from `orders`