app/Http/Controllers/Front/WebController.php

select `id`, `title`, `image` from `campaigns` where `status` = 1 order by `updated_at` desc limit 3
---
    public function homeOffers()
    {

        $campaign = Campaign::select('id', 'title', 'image')
            ->orderBy('updated_at', 'desc')
            ->where('status', '=', 1)
            ->take(3)
            ->get();

select * from `sub_categories` where `sub_categories`.`category_id` in (3) and `status` = 1
---
    public function categoryProduct($id, $slug)
    {
        $category = new CategoryResource(Category::with(['sub_category' => function ($query) {
            $query->where('status', '=', AllStatic::$active);
        }])
                ->find($id));

select * from `sub_sub_categories` where `sub_sub_categories`.`sub_category_id` in (9) and `status` = 1
select `id`, `category_name` from `categories` where `categories`.`id` in (2)
---
    public function subCategory($id, $slug = null)
    {

        $sub_category = SubCategory::with(['category:id,category_name',
            'sub_sub_category' => function ($query) {
                $query->where('status', '=', AllStatic::$active);
            }])
            ->find($id);

select * from `products` where `products`.`id` = '52' limit 1
select `colors`.*, `product_color`.`product_id` as `pivot_product_id`, `product_color`.`color_id` as `pivot_color_id` from `colors` inner join `product_color` on `colors`.`id` = `product_color`.`color_id` where `product_color`.`product_id` in (52)
select `id`, `brand_name` from `brands` where 0 = 1
select `id`, `sub_category_name` from `sub_categories` where `sub_categories`.`id` in (17)
---
    public function productDetails($id, $slug)
    {
        $product = Product::with([
            'category:id,category_name',
            'sub_category:id,sub_category_name',
            'brand:id,brand_name',
            'size',
            'color',
            'multiple_image',
        ])->find($id);