app/Http/Controllers/Email/EmailController.php

select `id`, `email` from `users`
select `id`, `email` from `subscribers`
---
    public function getEmails()
    {
        $data = [];
        $data['user'] = User::select('id','email')->get();
        $data['subscriber'] = Subscribe::select('id','email')->get();