app/Http/Controllers/Customer/CustomerController.php

select count(*) as aggregate from `users`
---
    public function getCustomer(Request $request)
    {

    	$customer = User::orderBy('updated_at','desc');
        if ($request->range != '')
         {
            $date = $request->range;
            $data = explode(",", $date);
            $start = date_convert($data[0]);
            $end = date_convert($data[1]);
            $customer->whereBetween('created_at', [$start, $end]);
         }

        if ($request->keyword != '')
        {
            $customer->where('name','LIKE','%'.$request->keyword.'%')
                     ->orWhere('email','LIKE','%'.$request->keyword.'%')
                     ->orWhere('phone','LIKE','%'.$request->keyword.'%');
        }


      $customer =  $customer->paginate(10);