app/Http/Controllers/Product/CategoryController.php

select count(*) as aggregate from `categories`
---
    public function categoryList(Request $request)
    {

        $category = Category::orderBy('updated_at', 'desc');

        if ($request->keyword != '') {
            $category->where('category_name', 'LIKE', '%' . $request->keyword . '%')
                ->orWhere('category_native_name', 'LIKE', '%' . $request->keyword . '%');

        }

        $category = $category->paginate(10);