app/Http/Controllers/Product/ColorController.php

    public function getColor()
    {
        $color = Color::select('id','name','color_code')
        ->orderBy('name','ASC')
        ->get();
---
select `id`, `name`, `color_code` from `colors` order by `name` asc