app/Http/Controllers/Product/ProductController.php

select `id`, `category_name`, `category_native_name` from `categories` order by `category_name` desc
---
    public function getAllCategory($edit_time = '')
    {
        $category = Category::select('id', 'category_name', 'category_native_name')
            ->orderBy('category_name', 'desc');
        // during edit time will pass a value and will get all category active in_active
        if ($edit_time = '') {
            $category->where('status', '=', AllStatic::$active);
        }
        return $category = $category->get();