app/Http/Controllers/Product/SubcategoryController.php

select count(*) as aggregate from `sub_categories`
---
    public function subCategoryList(Request $request){

     $sub_category = SubCategory::
                     with(['category:id,category_name,category_native_name'])
                     ->orderBy('updated_at','desc');

     if ($request->category != '' && $request->category != null)
     {

        $sub_category->where('category_id','=',$request->category);

        // return $request->category

     }

     if ($request->keyword != '')
      {

       $sub_category->where('sub_category_name','LIKE','%'.$request->keyword.'%')
                    ->orWhere('sub_category_native_name','LIKE','%'.$request->keyword.'%');

      }


      $sub_category = $sub_category->paginate(10);