app/Http/Controllers/Setting/CurrencyController.php

    public function currencyList(Request $request)
    {
        $currency = Currency::orderBy('currency_status','desc');

        if ($request->keyword) {

            $currency->where('country','LIKE','%'.$request->keyword.'%')
                     ->orwhere('currency','LIKE','%'.$request->keyword.'%')
                     ->orwhere('code','LIKE','%'.$request->keyword.'%')
                     ->orwhere('symbol','LIKE','%'.$request->keyword.'%');
        }

        $currency = $currency->paginate(15);
---
select * from `currency` order by `currency_status` desc limit 15 offset 0
select count(*) as aggregate from `currency`