app/Http/Controllers/Setting/DeliverySlotSettingController.php

select * from `delivery_slot_settings` order by `id` desc limit 1
---
    public function getSlot()
    {
        return DeliverySlotSetting::orderBy('id', 'desc')->first();