app/Http/Controllers/Setting/PaymentSettingController.php

select * from `payment_settings`
---
    public function paymentMethodList()
    {

        $payment_gateway = PaymentSetting::all();