app/Http/Controllers/Setting/PwaSettingController.php

    public function index()
    {
        return PwaSetting::orderBy('id', 'desc')->first();
---
select * from `pwa_settings` order by `id` desc limit 1