app/Http/Controllers/Setting/SeoSettingController.php

        }

        $fileName = uniqid().'.'.explode('/', explode(':', substr($imageData, 0, strpos($imageData, ';')))[1])[1];
        Image::make($request->get('meta_image'))->save('images/setting/seo/'.$fileName);
---
update `seo_settings` set `title` = 'Groco | Start Your Own Grocery Today', `meta_image` = '615d7dde29be2.jpeg', `description` = 'Groco is an grocery eCommerce solution for grocery based on laravel and vue.js', `seo_settings`.`updated_at` = '2021-10-06 16:43:42' where `id` = 1

         if (count($request->seo_keyword) > 0)
         {

          SeoKeyword::where('seo_setting_id','=',$seo->id)->delete();
---
delete from `seo_keywords` where `seo_setting_id` = 1

               $seo_keyword = new SeoKeyword;
               $seo_keyword->keyword = $value['keyword'];
               $seo_keyword->seo_setting_id   = $seo->id;
               $seo_keyword->save();
---
insert into `seo_keywords` (`keyword`, `seo_setting_id`, `updated_at`, `created_at`) values ('limmerz', 1, '2021-10-06 16:43:42', '2021-10-06 16:43:42')

    public function edit($id)
    {
        $seo = SeoSetting::with('seo_keyword:id,seo_setting_id,keyword')->find(1);
---
select * from `seo_settings` where `seo_settings`.`id` = 1 limit 1
select `id`, `seo_setting_id`, `keyword` from `seo_keywords` where `seo_keywords`.`seo_setting_id` in (1)