app/Http/Controllers/Setting/TimeSlotSettingController.php

select * from `delivery_time_s_lots` order by `expired_at` asc
---
    public function index()
    {
        $time_slot = DeliveryTimeSLot::orderBy('expired_at', 'asc')->get();