app/Http/Controllers/Offers/CampaignController.php

    public function offerList(Request $request)
    {

        $campaign = Campaign::orderBy('updated_at', 'desc');

        if ($request->keyword != '') {

            $campaign->where('title', 'LIKE', '%' . $request->keyword . '%');
        }
        $campaign = $campaign->paginate(10);
---
select count(*) as aggregate from `campaigns`