app/Http/Controllers/Offers/CouponController.php

select * from `coupons` order by `updated_at` desc limit 10 offset 0
select count(*) as aggregate from `coupons`
---
    public function couponList(Request $request)
    {
        $coupon = Coupon::orderBy('updated_at','desc');

         if ($request->keyword != '')
         {
             $coupon->where('coupon_code','LIKE','%'.$request->keyword.'%');
         }
        $coupon = $coupon->paginate(10);