app/Http/Controllers/Offers/SendCouponController.php

select `id`, `coupon_code`, `valid_date` from `coupons`
select `id`, `city` from `shipping_areas`
---
    public function index()
    {
        $coupons = Coupon::select('id','coupon_code','valid_date')->get();
        $locations = ShippingArea::select('id','city')->get();

select * from `user_coupon` order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in (1, 3)
select count(*) as aggregate from `user_coupon`
---
    public function customerCouponList(Request $request)
    {
        $coupon = UserCoupon::with('user')->orderBy('created_at','desc');

         if ($request->keyword != '')
         {
             $coupon->Where('coupon_code','LIKE','%'.$request->keyword.'%');
             $coupon->orWhere('user_id','LIKE','%'.$request->keyword.'%');
         }
        $coupon = $coupon->paginate(10);