app/Http/Controllers/Chart/ReportController.php

    public function getCatStock()
    {
        return Product::with('category:id,category_name')
                ->select('category_id',DB::raw('sum(current_quantity) as quantity'))
                ->groupBy('category_id')
                ->get();
---
select `category_id`, sum(current_quantity) as quantity from `products` group by `category_id`
select `id`, `category_name` from `categories` where `categories`.`id` in (1, 2, 3, 4, 5, 6, 7, 8)

    public function getMethodAmount(Request $request)
    {
        // return "Hello";
        $order = Order::with('provider:id,provider')->select(DB::raw('payment_method,payment_date,SUM(total_amount) as amount'))
         ->where('payment_method','!=',0)
         ->where('payment_status','=',1);

        if($request->methods != 'undefined')
         {
             $order->where('payment_method','=',$request->methods);
         }

         if($request->singledate != '')
         {
            $date = explode(' ', date_convert($request->singledate))[0];
            $order->where('payment_date',$date);
         }

         if($request->range != '')
         {
            $date = $request->range;
            $data = explode(",", $date);
            $start = date_convert($data[0]);
            $end = date_convert($data[1]);
            $order->whereBetween('payment_date', [$start, $end]);
         }

         return $order->groupBy('payment_method')->groupBy('payment_date')->paginate(10);
---
select count(*) as aggregate from (select payment_method,payment_date,SUM(total_amount) as amount from `orders` where `payment_method` != 0 and `payment_status` = 1 group by `payment_method`, `payment_date`) as `aggregate_table`