app/Http/Controllers/Dashboard/DashboardController.php

select count(*) as aggregate from `orders` where `payment_status` = 1
select count(*) as aggregate from `orders` where `payment_status` = 0
select count(*) as aggregate from `orders` where `status` = 3
select count(*) as aggregate from `orders` where `status` = 2
select count(*) as aggregate from `orders` where `status` = 0
select count(*) as aggregate from `orders` where `status` = 1
---
    public function show()
    {
        $stock = Product::sum('current_quantity');
        $category = Category::count();
        $subcategory = SubCategory::count();
        $product = Product::count();
        $customer = User::count();
        $order = Order::count();
        $paidorder = Order::where('payment_status', AllStatic::$paid)->count();
        $unpaidorder = Order::where('payment_status', AllStatic::$not_paid)->count();
        $delivered = Order::where('status', AllStatic::$delivered)->count();
        $ondelivery = Order::where('status', AllStatic::$on_delivery)->count();
        $pendingorder = Order::where('status', AllStatic::$pending)->count();
        $onprocess = Order::where('status', AllStatic::$processing)->count();