app/Http/Controllers/Admin/AdminController.php

select * from `shipping_areas` where `status` = 1
---
    public function areaList()
    {
        return ShippingArea::where('status', 1)->get();