app/Http/Controllers/Admin/RoleController.php

    public function RoleList(Request $request){

        $role = Role::orderBy('id','desc');

        if ($request->keyword)
        {
            $role->where('role_name','LIKE','%'.$request->keyword.'%');
        }

        $role = $role->paginate(10);
---
select * from `roles` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `roles`

    public function allRole()
    {
      $role = Role::orderBy('role_name','ASC')->get();
---
select * from `roles` order by `role_name` asc